#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Роль Из Метаданные.Роли Цикл
		РолиКонфигурации.Добавить(Роль.Имя, Роль.Синоним);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	
	ВыбранныеРоли = Новый Массив();
	
	Для Каждого Элемент Из РолиКонфигурации Цикл
		Если Элемент.Пометка Тогда
			ВыбранныеРоли.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(ВыбранныеРоли);
	
КонецПроцедуры

#КонецОбласти
 