#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ИсходнаяСтруктура) И ТипЗнч(Параметры.ИсходнаяСтруктура) = Тип("Структура") Тогда
		Для каждого КлючЗначение Из Параметры.ИсходнаяСтруктура Цикл
			НоваяСтрока = КлючиСтруктуры.Добавить();
			НоваяСтрока.Ключ = КлючЗначение.Ключ;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(КлючЗначение.Значение));
			 
			НоваяСтрока.ИсходныйТип = Новый ОписаниеТипов(МассивТипов);
			
			Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
				Значение = Новый СписокЗначений;
				Значение.ЗагрузитьЗначения(КлючЗначение.Значение);
			Иначе
				Значение = КлючЗначение.Значение;
			КонецЕсли;
			
			НоваяСтрока.Значение = Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлючиСтруктуры

&НаКлиенте
Процедура КлючиСтруктурыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Модифицированность Тогда
		ЗакрытьФормуСВопросом();
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗакрытьФормуСВопросом()
	
	Ответ = Ждать ВопросАсинх("Сохранить изменения?",РежимДиалогаВопрос.ДаНетОтмена, 60);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = Новый Структура;
		Для каждого СтрокаТЗ Из КлючиСтруктуры Цикл
			Если СтрокаТЗ.ИсходныйТип = Тип("Массив") Тогда
				Значение = СтрокаТЗ.Значение.ВыгрузитьЗначения();
			Иначе
				Значение = СтрокаТЗ.Значение;
			КонецЕсли;
			Результат.Вставить(СтрокаТЗ.Ключ, Значение);
		КонецЦикла;
		
		Закрыть(Результат);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Закрыть(Параметры.ИсходнаяСтруктура);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 