#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ИсходнаяСтруктура) И ТипЗнч(Параметры.ИсходнаяСтруктура) = Тип("Структура") Тогда
		Для каждого КлючЗначение Из Параметры.ИсходнаяСтруктура Цикл
			НоваяСтрока = КлючиСтруктуры.Добавить();
			НоваяСтрока.Ключ = КлючЗначение.Ключ;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(КлючЗначение.Значение));
			 
			НоваяСтрока.ИсходныйТип = Новый ОписаниеТипов(МассивТипов);
			
			НоваяСтрока.Тип = НоваяСтрока.ИсходныйТип; 
			
			Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
				Значение = Новый СписокЗначений;
				Значение.ЗагрузитьЗначения(КлючЗначение.Значение);
			Иначе
				Значение = КлючЗначение.Значение;
			КонецЕсли;
			
			НоваяСтрока.Значение = Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлючиСтруктуры

&НаКлиенте
Процедура КлючиСтруктурыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючиСтруктурыТипНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СтрокаТаблицы = Элементы.КлючиСтруктуры.ТекущиеДанные;
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИсходноеОписаниеТипов", СтрокаТаблицы.Тип);
	
	ПараметрыОбработкиВыбора = Новый Структура("ИДСтроки", СтрокаТаблицы.ПолучитьИдентификатор());
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораТипаЗначения", ЭтотОбъект, ПараметрыОбработкиВыбора);
	
	ИмяФормыРедактора = ПолноеИмяФормы("ФормаВыборТипаЗначения");
	ОткрытьФорму(ИмяФормыРедактора, СтруктураПараметров, ЭтотОбъект, , , , 
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Модифицированность Тогда
		ЗакрытьФормуСВопросом();
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗакрытьФормуСВопросом()
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Сохранить изменения?'; en = 'Save the changes?'"),РежимДиалогаВопрос.ДаНетОтмена, 60);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = Новый Структура;
		Для каждого СтрокаТЗ Из КлючиСтруктуры Цикл
			Если ТипЗнч(СтрокаТЗ.Значение) = Тип("СписокЗначений")
				И СтрокаТЗ.Тип <> Неопределено
				И СтрокаТЗ.Тип.СодержитТип(Тип("Массив")) Тогда
				Значение = СтрокаТЗ.Значение.ВыгрузитьЗначения();
			Иначе
				Значение = СтрокаТЗ.Значение;
			КонецЕсли;
			Результат.Вставить(СтрокаТЗ.Ключ, Значение);
		КонецЦикла;
		
		Закрыть(Результат);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Закрыть(Параметры.ИсходнаяСтруктура);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Функция ПолноеИмяФормы(Знач ИмяВызываемойФормы)
	Возврат СтрЗаменить(ИмяФормы, "ФормаРедактированияСтруктуры", ИмяВызываемойФормы);
КонецФункции

&НаКлиенте
Процедура ПослеВыбораТипаЗначения(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		СтрокаТаблицы = КлючиСтруктуры.НайтиПоИдентификатору(ДополнительныеПараметры.ИДСтроки);
		Если СтрокаТаблицы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтрокаТаблицы.Тип = ВыбранноеЗначение.ОписаниеТипов;
		
		Если ВыбранноеЗначение.ОписаниеТипов.СодержитТип(Тип("Массив")) Тогда
			// Массив не может использоваться в данных формы, поэтому значение храним как СписокЗначений.
			СписокМассива = Новый СписокЗначений;
			
			ТипЭлементов = Неопределено;
			Если ВыбранноеЗначение.Свойство("ТипыЭлементовКонтейнеров") Тогда
				ТипЭлементов = ВыбранноеЗначение.ТипыЭлементовКонтейнеров[Тип("Массив")];
			КонецЕсли;
			
			Если ТипЭлементов <> Неопределено Тогда
				СписокМассива.ТипЗначения = ТипЭлементов;
			КонецЕсли;
			
			СтрокаТаблицы.Значение = СписокМассива;
		Иначе
			СтрокаТаблицы.Значение = ВыбранноеЗначение.ОписаниеТипов.ПривестиЗначение(СтрокаТаблицы.Значение);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти