
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, 
		"ГруппаСлужебныхПользователей, ПрефиксИмениПользователяРЗ, ИмяМодуляРегламентныхЗаданий, ИмяМодуляРегламентныхЗаданий, ПрефиксМетаданных, РазрешитьДобавлениеПользователейРегламентныхЗаданий, РассчитыватьДатуСледующегоЗапускаРегламентногоЗадания");

	МассивИзбранных = Неопределено;		
	Если Параметры.Свойство("Избранное", МассивИзбранных) Тогда
		Избранное.ЗагрузитьЗначения(МассивИзбранных);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСлужебныхПользователейПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСлужебныхПользователейНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрФормыВыбора = Новый Структура;
	ПараметрФормыВыбора.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрФормыВыбора, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСлужебныхПользователейОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаСлужебныхПользователей = Строка(ВыбранноеЗначение.УникальныйИдентификатор());
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	НастройкиИзменены = Ложь;
	Если Модифицированность Тогда
	
		НастройкиКонсоли = ТекущиеНастройкиКонсоли(ЭтотОбъект);
		
		СохранитьНастройкиНаСервере(НастройкиКонсоли);
		
		Модифицированность = Ложь;
		НастройкиИзменены = Истина;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкиИзменены", НастройкиИзменены);
	Результат.Вставить("Настройки", НастройкиКонсоли);
	
	Закрыть(Результат);
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ОчиститьИзбранное(Команда)
	
	ТекстВопроса = НСтр("ru = 'Очистить список избранного?'; en = 'Clear favorites list?'");	
	Ответ = Ждать ВопросАсинх(ТекстВопроса,
		 РежимДиалогаВопрос.ДаНет, 
		 30,
		 КодВозвратаДиалога.Да, "",
		 КодВозвратаДиалога.Нет
	);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Избранное.Очистить();
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФорму()
	
	ИменаМетаданных = ИменаЛокализованныхМетаданных();
	
	Если Метаданные.Справочники.Найти(ИменаМетаданных.СправочникГруппыПользователей) = Неопределено Тогда
		
		Элементы.ГруппаСлужебныхПользователей.Видимость = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ИмяСправочникаГруппыПользователей = ИменаМетаданных.СправочникГруппыПользователей;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИменаЛокализованныхМетаданных()
	
	ИменаМетаданных = Новый Структура;
	ИменаМетаданных.Вставить("СправочникГруппыПользователей", "ГруппыПользователей");
		
	Если Метаданные.ОсновнойЯзык.КодЯзыка = "en" Тогда
		
		ИменаМетаданных.СправочникГруппыПользователей = "UserGroups";
		
	КонецЕсли;
	
	Возврат ИменаМетаданных;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекущиеНастройкиКонсоли(Форма)
	
	НастройкиКонсоли = Новый Структура;
	НастройкиКонсоли.Вставить("ПериодАвтообновления", Форма.ПериодАвтообновления);
	НастройкиКонсоли.Вставить("ИмяМодуляРегламентныхЗаданий", Форма.ИмяМодуляРегламентныхЗаданий);
	НастройкиКонсоли.Вставить("ПрефиксМетаданных", Форма.ПрефиксМетаданных);
	НастройкиКонсоли.Вставить("ПрефиксИмениПользователяРЗ", Форма.ПрефиксИмениПользователяРЗ);
	НастройкиКонсоли.Вставить("ГруппаСлужебныхПользователей", Форма.ГруппаСлужебныхПользователей);
	НастройкиКонсоли.Вставить("РазрешитьДобавлениеПользователейРегламентныхЗаданий", Форма.РазрешитьДобавлениеПользователейРегламентныхЗаданий);
	НастройкиКонсоли.Вставить("РассчитыватьДатуСледующегоЗапускаРегламентногоЗадания", Форма.РассчитыватьДатуСледующегоЗапускаРегламентногоЗадания);
	НастройкиКонсоли.Вставить("Избранное", Форма.Избранное.ВыгрузитьЗначения());
	
	Возврат НастройкиКонсоли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Знач НастройкиКонсоли)
	
	ХранилищеОбщихНастроек.Сохранить(
		КлючОбъекта(), КлючНастроек(), НастройкиКонсоли
	);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючОбъекта()
	
	Возврат НСтр("ru = 'КонсольРегламентныхИФоновыхЗаданий'; en = 'ScheduledAndBackroundJobsConsole'");
	
КонецФункции

&НаСервереБезКонтекста
Функция КлючНастроек()
	
	Возврат НСтр("ru = 'Настройки консоли заданий'; en = 'Jobs console settings'");
	
КонецФункции

#КонецОбласти
