
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, 
		"ПрефиксИмениПользователяРЗ, ИмяМодуляРегламентныхЗаданий, ПериодАвтообновления,
		| ПрефиксМетаданных, РазрешитьДобавлениеПользователейРегламентныхЗаданий,
		| РассчитыватьДатуСледующегоЗапускаРегламентногоЗадания");

	МассивИзбранных = Неопределено;		
	Если Параметры.Свойство("Избранное", МассивИзбранных) Тогда
		Избранное.ЗагрузитьЗначения(МассивИзбранных);
	КонецЕсли;
	
	НастроитьФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазрешитьДобавлениеПользователейРегламентныхЗаданийПриИзменении(Элемент)
	
	НастроитьФорму(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	НастройкиИзменены = Ложь;
	Если Модифицированность Тогда
	
		НастройкиКонсоли = ТекущиеНастройкиКонсоли(ЭтотОбъект);
		
		СохранитьНастройкиНаСервере(НастройкиКонсоли);
		
		Модифицированность = Ложь;
		НастройкиИзменены = Истина;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкиИзменены", НастройкиИзменены);
	Результат.Вставить("Настройки", НастройкиКонсоли);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОчиститьИзбранное(Команда)
	
	ТекстВопроса = НСтр("ru = 'Очистить список избранного?'; en = 'Clear favorites list?'");	
	Ответ = Ждать ВопросАсинх(ТекстВопроса,
		 РежимДиалогаВопрос.ДаНет, 
		 30,
		 КодВозвратаДиалога.Да, "",
		 КодВозвратаДиалога.Нет
	);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Избранное.Очистить();
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Функция ПолноеИмяФормы(Знач ИмяВызываемойФормы)
	Возврат СтрЗаменить(ИмяФормы, "ФормаНастройкиКонсоли", ИмяВызываемойФормы);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФорму(Форма)
		
	Элементы = Форма.Элементы;
	Элементы.ГруппаПараметрыСозданияПользователей.Видимость = Форма.РазрешитьДобавлениеПользователейРегламентныхЗаданий;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекущиеНастройкиКонсоли(Форма)
	
	НастройкиКонсоли = Новый Структура;
	НастройкиКонсоли.Вставить("ПериодАвтообновления", Форма.ПериодАвтообновления);
	НастройкиКонсоли.Вставить("ИмяМодуляРегламентныхЗаданий", Форма.ИмяМодуляРегламентныхЗаданий);
	НастройкиКонсоли.Вставить("ПрефиксМетаданных", Форма.ПрефиксМетаданных);
	НастройкиКонсоли.Вставить("ПрефиксИмениПользователяРЗ", Форма.ПрефиксИмениПользователяРЗ);
	НастройкиКонсоли.Вставить("РазрешитьДобавлениеПользователейРегламентныхЗаданий", Форма.РазрешитьДобавлениеПользователейРегламентныхЗаданий);
	НастройкиКонсоли.Вставить("РассчитыватьДатуСледующегоЗапускаРегламентногоЗадания", Форма.РассчитыватьДатуСледующегоЗапускаРегламентногоЗадания);
	НастройкиКонсоли.Вставить("Избранное", Форма.Избранное.ВыгрузитьЗначения());
	
	Возврат НастройкиКонсоли;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере(Знач НастройкиКонсоли)
	
	МодульОбъекта = РеквизитФормыВЗначение("Объект");
	ХранилищеОбщихНастроек.Сохранить(
		МодульОбъекта.КлючОбъекта(), МодульОбъекта.КлючНастроек(), НастройкиКонсоли
	);
	
КонецПроцедуры

#КонецОбласти
